SELECT Заказ.Номер, Книга.Название, Писатель.Фамилия, Писатель.Имя
FROM Заказ
JOIN Книга ON Заказ.Книга_id_Книга = Книга.id_Книга
JOIN писатель_has_книга ON книга.id_Книга = писатель_has_книга.Книга_id_Книга
JOIN писатель ON писатель_has_книга.Писатель_id_Писатель = писатель.id_Писатель;

SELECT Фамилия, Имя
FROM Писатель
ORDER BY Фамилия;

SELECT Писатель.Фамилия, COUNT(книга.id_Книга) as Количество_книг
FROM Писатель
JOIN писатель_has_книга ON писатель.id_Писатель = писатель_has_книга.Писатель_id_Писатель
JOIN Книга ON писатель_has_книга.Книга_id_Книга = Книга.id_Книга
GROUP BY Писатель.Фамилия;

SELECT DISTINCT Обращаться
FROM Заказчик;

SELECT Номер_контракта
FROM Контракт
WHERE Дата_заключения > '2016-11-10';

SELECT Count(Номер_контракта) as 'Кол-во'
FROM Контракт
WHERE Дата_заключения BETWEEN '2016-11-10' AND '2020-11-10';

SELECT *
FROM Писатель
WHERE фамилия LIKE 'С%';

SELECT *
FROM Контракт
WHERE Дата_расторжения IS NULL;

UPDATE `evm_26`.`заказ` SET `Номер` = '5000' WHERE (`id_Заказ` = '20');
INSERT INTO `evm_26`.`заказ` (`id_Заказ`, `Номер`, `Дата_поступления`, `Дата_выполнения`, `Книга_id_Книга`, `Заказчик_id_Заказчик`) VALUES ('21', '4100', '2024-04-29 00:00:00', '2024-12-02 00:00:00', '1899', '120');
DELETE FROM `evm_26`.`заказ` WHERE (`id_Заказ` = '21');
